Tekla Open API Reference for Tekla Structures 2025
Parallel.VectorToVector Method
Overload List
Name | Description
VectorToVector(Vector, Vector)
 Returns true if the given vectors are parallel.
VectorToVector(Vector, Vector, Double)
 Returns true if the given vectors are parallel within the given angular tolerance.
Top
See Also
Reference
Parallel Class
Tekla.Structures.Geometry3d Namespace